delete from course;
delete from  teacher;
delete from student ;
delete from major ;
delete from department;
delete from place;



insert into course values ('101260030', '	艺术设计史', '01', '3', '必修', '50', '1-18周', '周一，3-4节','艺术系');
insert into course values ('101272010', '	影视编导专题讲座、影视表演专题讲座', '02', '1', '选修', '100', '2-7周', '周一，10-11节','艺术系');
insert into course values ('101953030', '	景观设计史', '05', '3', '必修', '60', '1-18周', '周一，5-7节','艺术系');
insert into course values ('304026020'  , '汇编语言程序设计', '02', '2','必修','50', '1-18周', '周二，5-7节','计算机系');




insert into teacher values ('10101','李明', '男', '42', '江安 ,二基楼 B502', '图形图像研究',  '13698761234', '教授',  '3456671234@qq.com',  '计算机系' , '汇编语言程序设计' ,'304026020'  ,'02','02''必修','50');



insert into student values ('2016181962002', '李明', '男', '22', '13698761234', '3456671234@qq.com', '成都第二中学', '四川 成都', '看书', '艺术系', '声乐专业');

insert into student values ('2016181962003', '徐梦玲', '女', '22', '18698763550', '1255271234@qq.com', '天水第一中学', '甘肃 天水', '看综艺', '法学系', '法学专业');

insert into student values ('2016141462004', '李泽洋', '男', '20', '13898093534', '3689671234@qq.com', '成都第二中学', '四川 成都', '打游戏', '艺术系', '油画专业');

insert into student values ('2016171072005','钱浩军', '男', '23', '19078761234', '3422451234@qq.com', '陇南第一中学', '甘肃 陇南', '看书', '数学系', '基础数学专业');

insert into student values ('2016141460006', '王海波', '男', '22', '13600231234', '5636671234@qq.com', '绵阳第二中学', '四川 绵阳', '看书', '计算机系', '计算机科学与技术专业');

insert into student values ('2016121340007','李明', '男', '22', '13698761234', '3456671234@qq.com', '成都第二中学', '四川 成都', '读书', '经济系', '经济学专业');

insert into student values ('2016171900108','李思婷', '女', '23', '13690251234', '3501671234@qq.com', '成都第二十中学', '四川 成都', '读书', '计算机系', '物联网专业');

insert into student values ('201617190209', '孟雨灵', '女', '22', '13604672234', '893471234@qq.com', '成都阳明中学', '四川 成都', '运动', '经济系', '国民经济管理专业');

insert into student values ('201616150510','陈梓菲', '女', '20', '13691471234', '3466671256@qq.com', '成都第二中学', '四川 成都', '读书', '艺术系', '编导专业');

insert into student values ('2016161803011', '罗明瑞', '男', '22', '13639061234', '3601671234@qq.com', '成都第四中学', '四川 成都', '运动', '化学系', '化学工程专业');

insert into student values ('2016141540012', '廖温峰', '男', '22', '18398761234', '5636674534@qq.com', '北京第二中学', '北京', '旅游', '公共管理系', '行政管理专业');

insert into student values ('2016167820013', '刘道涛', '男', '22', '17692371234', '346671004@qq.com', '上海第二附属中学', '上海', '打篮球', '经济系', '金融学专业');

insert into student values ('2016148730014', '胡斯涵', '男', '22', '18398561234', '39023767104@qq.com', '成都第二附属中学', '四川 成都', '读书', '公共管理系', '教育经济管理专业');

insert into student values ('2016456790015', '李清素', '女', '22', '13348768434', '7346671614@qq.com', '武汉第二中学', '湖北 武汉', '读书', '建筑系', '土木工程专业');


insert into major values ('3040000001',  '计算机科学与技术专业', '027-7000011', '学习编程',  '计算机系');


insert into department values ('2016000001', '计算机系', '13348768434', '全国排名第十');
insert into department values ('2016000002', '艺术系', '13343458434', '全国排名第八');

insert into place values ('江安校区', '一教A101');
insert into place values ('江安校区', '一教B101');
insert into place values ('江安校区', '一教C101');
insert into place values ('江安校区', '一教A301');
insert into place values ('江安校区', '一教A105');
insert into place values ('望江校区', '基础教学楼C201');
